app/Controllers/Kasir.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-08%' ESCAPE '!'
SELECT `transaksi`.`tanggal` as `tanggal`, `total_bayar`, `uang`, `kembalian`, group_concat(nama, '-', jumlah ) as barang
FROM `transaksi`
JOIN `transaksi_barang` ON `transaksi`.`id`=`transaksi_barang`.`id_transaksi`
WHERE day(tanggal) = '08'
GROUP BY `transaksi`.`id`
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-08%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE MONTH(tanggal) = '03'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE MONTH(tanggal) = '02'
SELECT `nama`, `stock`
FROM `gudang`
ORDER BY `stock` ASC
---
    public function index()
    {
        // DEKLARASI
        $tgl = date('Y-m-d');
        $bulan = date('m');
        $bulanSebelumnya = date('m', strtotime(date('Y-m') . " -1 month"));

        // GET DATA
        $transaksiHarian = $this->Transaksi->like('tanggal', $tgl)->countAllResults();
        $transaksiHariIni = $this->Transaksi->select('transaksi.tanggal as tanggal, total_bayar, uang, kembalian, group_concat(nama, \'-\' ,jumlah ) as barang')->where('day(tanggal)', date('d'))
            ->join('transaksi_barang', 'transaksi.id=transaksi_barang.id_transaksi')
            ->groupBy('transaksi.id')
            ->get()->getResultArray();
        $totalPendapatanHarian = $this->Transaksi->like('tanggal', $tgl)->selectSUM('total_bayar')
            ->get()->getFirstRow()->total_bayar;
        $totalPendapatanBulanan = $this->Transaksi->selectSUM('total_bayar')->where('MONTH(tanggal)', $bulan)
            ->get()->getFirstRow()->total_bayar;
        $totalPendapatanBulanSebelumnya = $this->Transaksi->selectSUM('total_bayar')->where('MONTH(tanggal)', $bulanSebelumnya)
            ->get()->getFirstRow()->total_bayar;
        $selisihBulanSebelumnya = number_format((((int)$totalPendapatanBulanan - (int)$totalPendapatanBulanSebelumnya) / (int)$totalPendapatanBulanSebelumnya) * 100, 2, '.', '');
        $barangDanStok = $this->Gudang->select('nama, stock')->orderBy('stock', 'ASC')->get()->getResultArray();

SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-06%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-07%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-08%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-09%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-10%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-11%' ESCAPE '!'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE `tanggal` LIKE '%2023-03-12%' ESCAPE '!'
---
    private function setDataWeeklyChart()
    {
        $tgl = date('Y-m-d');
        $senin = date('Y-m-d', strtotime('Monday this week', strtotime($tgl)));
        $selasa = date('Y-m-d', strtotime('Tuesday this week', strtotime($tgl)));
        $rabu = date('Y-m-d', strtotime('Wednesday this week', strtotime($tgl)));
        $kamis = date('Y-m-d', strtotime('Thursday this week', strtotime($tgl)));
        $jumat = date('Y-m-d', strtotime('Friday this week', strtotime($tgl)));
        $sabtu = date('Y-m-d', strtotime('Saturday this week', strtotime($tgl)));
        $minggu = date('Y-m-d', strtotime('Sunday this week', strtotime($tgl)));

        $result = [
            'Senin' => $this->Transaksi->like('tanggal', $senin)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Selasa' => $this->Transaksi->like('tanggal', $selasa)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Rabu' => $this->Transaksi->like('tanggal', $rabu)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Kamis' => $this->Transaksi->like('tanggal', $kamis)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Jumat' => $this->Transaksi->like('tanggal', $jumat)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Sabtu' => $this->Transaksi->like('tanggal', $sabtu)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Minggu' => $this->Transaksi->like('tanggal', $minggu)->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
        ];

SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '02'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '03'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '04'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '05'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '06'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '07'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '08'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '09'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '10'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '11'
SELECT SUM(`total_bayar`) AS `total_bayar`
FROM `transaksi`
WHERE month(tanggal) = '12'
---
    private function setDataMonthlyChart()
    {
        $result = [
            'Januari' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('january this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Februari' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('february this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Maret' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('march this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'April' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('april this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Mei' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('may this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Juni' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('june this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Juli' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('july this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Agustus' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('august this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'September' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('september this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Oktober' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('october this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'November' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('november this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,
            'Desember' => $this->Transaksi->where('month(tanggal)', date('m', strtotime('december this week')))->selectSUM('total_bayar')->get()->getFirstRow()->total_bayar,

SELECT `transaksi_barang`.`nama` as `nama`, count(transaksi_barang.jumlah) as jumlah
FROM `transaksi`
JOIN `transaksi_barang` ON `transaksi`.`id`=`transaksi_barang`.`id_transaksi`
WHERE day(tanggal) = '08'
GROUP BY `nama`
---
    private function setDataBarangDaily()
    {
        $result = $this->Transaksi->select('transaksi_barang.nama as nama, count(transaksi_barang.jumlah) as jumlah')
            ->where('day(tanggal)', date('d'))
            ->join('transaksi_barang', 'transaksi.id=transaksi_barang.id_transaksi')
            ->groupBy('nama')
            ->get()->getResultArray();