app/Controllers/Kasir.php

SELECT *
FROM `gudang`
ORDER BY `nama`
---
    public function penjualan()
    {
        $data = [
            'row' => $this->Gudang->orderBy('nama')->findAll()
        ];

SELECT *
FROM `gudang`
ORDER BY `nama`
---
    public function gudang()
    {
        $data = [
            'row' => $this->Gudang->orderBy('nama')->findAll()
        ];

UPDATE `gudang` SET `stock` = stock-1, `updated_at` = '2023-02-06 10:54:47'
WHERE `id` = '4'
---
    public function gudangAddStock()
    {
        $data = $this->request->getVar();
        $id = $data['id'];
        $stock = $this->Gudang->select('stock')->where('id', $id)->get()->getFirstRow();
        $stock = (int)$stock->stock + (int)$data['stock'];
        $this->Gudang->save([
            'id' => $data['id'],
            'stock' => $stock
        ]);

SELECT *
FROM `gudang`
WHERE `id` = '1'
---
    public function gudangView($id)
    {
        $data = [
            'row' => $this->Gudang->where('id', $id)->get()->getFirstRow()
        ];